////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////// คู่มือการใช้งาน ////////////////////////////////////////////////////////////////////////////////////////////

// OK(); // wait for sw OK
// START(); // wait for sw START


////////////////////////////////// คำสั่งเคลื่อนที่ ///////////////////////////////////////////////////////////////////
// Motor(ความเร็วมอเตอร์ซ้าย , ความเร็วมอเตอร์ขวา); // คำสั่งเคลื่อนที่มอเตอร์
// Move(ความเร็วมอเตอร์ซ้าย , ความเร็วมอเตอร์ขวา, เวลาที่ใช้ ); // คำสั่งเคลื่อนที่มอเตอร์พร้อม delay เวลาที่ใช้ หน่วย 1000 = 1วินาที


////////////////////////////////// คำสั่งเลี้ยว //////////////////////////////////////////////////////////////////
// >> SpinL();                 // หมุนหุ่นยนต์ด้านซ้าย
// >> SpinL2();                // หมุนหุ่นยนต์ด้านซ้าย 2 แยก
// >> SpinR();                 // หมุนหุ่นยนต์ด้านขวา
// >> SpinR2();                // หมุนหุ่นยนต์ด้านขวา 2 แยก

////////////////////////////////// คำสั่งวิ่งนับแยก //////////////////////////////////////////////////////////////////
// >> คำสั่งเจอแยก 'l' = กลางหุ่นหน้าเลี้ยวซ้าย , 'r' = กลางหุ่นหน้าเลี้ยวขวา  , 'p' = ตรง     , 's' = หยุด        , 'c' = กลางหุ่นหน้า
// >> คำสั่งเจอแยก 'L' = กลางหุ่นเลี้ยวซ้าย    , 'R' = กลางหุ่นเลี้ยวขวา      , 'C' = กลางหุ่น , 'q' = หน้าเลี้ยวซ้าย , 'e' = หน้าเลี้ยวขวา


// >> FF(ความเร็ว, 'คำสั่งเจอแยก');   // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ใดก็ได้
// >> FFC(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่กลาง
// >> FFL(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ซ้าย
// >> FFR(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ขวา
// >> FFNUM(ความเร็ว, 'คำสั่งเจอแยก', 0->7);  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์ที่ใช้จับแยก
// >> FF_DISTANCE(ความเร็ว, 'คำสั่งเจอแยก', 4->30);  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์วัดระยะ

// >> BB(ความเร็ว, 'คำสั่งเจอแยก');   // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ใดก็ได้
// >> BBC(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่กลาง
// >> BBL(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ซ้าย
// >> BBR(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ขวา
// >> BBNUM(ความเร็ว, 'คำสั่งเจอแยก', 0->7);  // วิ่งตามเส้น PID ไปด้านหลังเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์ที่ใช้จับแยก

// >> FFtimer(ความเร็ว,เวลา);  // วิ่งตามเส้นด้วย PID Timer ไปข้างหน้า
// >> BBtimer(ความเร็ว,เวลา);  // วิ่งตามเส้นด้วย PID Timer ไปข้างหลัง


////////////////////////////////// คำสั่ง Servo //////////////////////////////////////////////////////////////////
// >> ServoOpen();   // อ้าที่คีบ
// >> ServoClose();  // หนีบที่คีบ
// >> ServoUp();     // ยกที่คีบ
// >> ServoDown();   // วางที่คีบ

